app/Controllers/UserController.php

    public function index()
    {
        $user = $this->user_model->findAll();
---
SELECT *
FROM `users`
WHERE `users`.`deleted_at` IS NULL